import '../models/location.dart';
import '../models/location_fact.dart';

final List<Location> dummyLocations = [
  Location(
      id: 1,
      name: 'Селекційна станція',
      imagePath: 'assets/images/breeding_st.jpg',
      tourPackageName: 'Пакет Український модерн',
      summary: 'За домовленістю',
      facts: [
        LocationFact('Про пам\'ятку',
            'Харківська селекційна станція так і лишилася недобудованою. Вишукану красу головної споруди вигідно підкреслюють скромні, та не менш вишукані будиночки, що вільно розкинулися по садибі.'),
        LocationFact('Як дістатися',
            'Задля неї варто заїхати у неблизький пролетарський район міста, аби на контрасті оцінити пластику і стриманий декор лабораторного корпусу, оточеного старими деревами.'),
      ]),
  Location(
      id: 2,
      name: 'Котеджне містечко',
      imagePath: 'assets/images/trotsenko_houses.jpg',
      tourPackageName: 'Пакет Троценко',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Чотириквартирні двоповерхові будинки блокувалися у дві дзеркально-симетричні секції. Секція складалася з двох різних за плануванням, але однакових за складом приміщень окремих трикімнатних квартир, розташованих в двох рівнях. Вони були розраховані на заселення сім’ями з 4-5 людей.'),
        LocationFact(
            'Як дістатися', 'Знаходяться неподалік універмагу "Харків"'),
      ]),
  Location(
      id: 3,
      name: 'Школа старшин',
      imagePath: 'assets/images/sherv_starsh.jpg',
      tourPackageName: 'Пакет Конструктивізм',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Цей заклад підготував у міжвоєнний час близько 1000 червоних командирів, а в 1920-х роках, це була передова інституція, що запровадила розповсюдження української мови у Червоній армії. '),
        LocationFact('Як дістатися',
            'У районі Холодної гори вздовж Полтавського шляху багато об’єктів, що будувались для військових. Це не дивно – тут у радянські часи містився військовий гарнізон. '),
      ]),
  Location(
      id: 4,
      name: 'Селище Артема',
      imagePath: 'assets/images/artema_sel.jpg',
      tourPackageName: 'Пакет Конструктивізм',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Селище Артема знаходиться в "мішку" промислової забудови Слобідського району, напевно тому таке відчуття, що час тут якщо не зупинився, то явно сповільнився'),
        LocationFact('Як дістатися',
            'Метро завод ім. Малишева, потім можна через парк Машинобувіників'),
      ]),
  Location(
      id: 5,
      name: 'Двадцятий будинок',
      imagePath: 'assets/images/20_y.jpg',
      tourPackageName: 'ХТЗ Package',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Будинок довжиною 600 метрів має 38 під\'їздів та виходить одночасно на три вулиці району займаючи цілий квартал. Будувався в 1930-тї роки в рамках проєкту Соцмістечка Новий Харків, тоді він іменувався 3-м житлокомбінатом і призначався для іноземних фахівців.'),
        LocationFact('Як дістатися',
            'Метро Тракторний завод, вихід проти руху поїзда і наліво.'),
      ]),
  Location(
      id: 6,
      name: 'Житлові будинки',
      imagePath: 'assets/images/rzhepish.jpg',
      tourPackageName: 'Пакет Ржепішевський',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Житлові будинки: вул. Чайковська, 15 (1910-ті роки, архітектор Гінзбург Олександр Маркович); вул. Чайковська, 17 (1910-ті, архітектор Ржепишевський Олександр Іванович).'),
        LocationFact('Як дістатися', 'Метро Пушкінська, вул. Чайковська, 17.'),
      ]),
  Location(
      id: 7,
      name: 'Будинок Бурткевича',
      imagePath: 'assets/images/burtkevich.jpg',
      tourPackageName: 'Пакет Історичний центр',
      summary: '24/7 hours',
      facts: [
        LocationFact('Про пам\'ятку',
            'Будинок був збудований у 1888 р. за проектом Олександра Шиле, який був доопрацьований архітектором А. Томсоном.'),
        LocationFact('Як дістатися',
            'Метро Площа Конституції, вул. Полтавський Шлях, 1.'),
      ]),
];
